MORSE_CODE_DICT = {
    '·−': 'A',
    '−···': 'B',
    '−·−·': 'C',
    '−··': 'D',
    '·': 'E',
    '··−·': 'F',
    '−−·': 'G',
    '····': 'H',
    '··': 'I',
    '·−−−': 'J',
    '−·−': 'K',
    '·−··': 'L',
    '−−': 'M',
    '−·': 'N',
    '−−−': 'O',
    '·−−·': 'P',
    '−−·−': 'Q',
    '·−·': 'R',
    '···': 'S',
    '−': 'T',
    '··−': 'U',
    '···−': 'V',
    '·−−': 'W',
    '−··−': 'X',
    '−·−−': 'Y',
    '−−··': 'Z',
    '-----': '0',
    '·−−−−': '1',
    '··−−−': '2',
    '···−−': '3',
    '····−': '4',
    '·····': '5',
    '−····': '6',
    '−−···': '7',
    '−−−··': '8',
    '−−−−·': '9',
    '·−·−·−': '.',  # точка
    '−−··−−': ',',  # запятая
    '·−−−·−·−': ':',  # двоеточие
    '−−··−−·': ';',  # точка с запятой
    '·−·−·−·−·−': '?',  # вопросительный знак
    '−··−·': '-',  # дефис
    '··−−··−': '_',  # подчеркивание
    '···−···': '"',  # кавычки
    '·−··−·': "'",  # апостроф
    '−·−−−−': '(',  # открывающая скобка
    '−·−−−−−': ')',  # закрывающая скобка
    '·−···': '=',  # знак равенства
    '−···−': '/',  # слэш
    '−·−·−−': '@',  # собака
    '··−··−': '$',  # знак доллара
    '·−··−··': '+',  # знак плюса
    '−····−': '!',  # восклицательный знак
    '··−−−··': '|',  # вертикальная черта
    '····−·': '&',  # знак "и"
    '·−···−': '%',  # знак процента
    '·····−': '#',  # знак решетки
    '−·−·−·': '^',  # крышка
    '·−−·−−': '~',  # тильда
    '·−·−·': '[',  # открывающая квадратная скобка
    '−·−·−': ']',  # закрывающая квадратная скобка
    '−··−··': '{',  # открывающая фигурная скобка
    '··−··−': '}',  # закрывающая фигурная скобка
}
